[{"id":1,"name":"Spaghetti Bolognese","description":"A classic Italian pasta dish.","image":"/spaghetti.png","ingredients":["1 tbsp olive oil","4 rashers smoked streaky bacon, finely chopped","2 medium onions, finely chopped","2 carrots, trimmed and finely chopped","2 celery sticks, finely chopped","2 garlic cloves finely chopped","2-3 sprigs rosemary leaves picked and finely chopped","500g beef mince"],"directions":["Put a large saucepan on a medium heat and add 1 tbsp olive oil.","Add 4 finely chopped bacon rashers and fry for 10 mins until golden and crisp.","Reduce the heat and add the 2 onions, 2 carrots, 2 celery sticks, 2 garlic cloves and the leaves from 2-3 sprigs rosemary, all finely chopped, then fry for 10 mins. Stir the veg often until it softens.","Increase the heat to medium-high, add 500g beef mince and cook stirring for 3-4 mins until the meat is browned all over.","Add 2 tins plum tomatoes, the finely chopped leaves from ¾ small pack basil, 1 tsp dried oregano, 2 bay leaves, 2 tbsp tomato purée, 1 beef stock cube, 1 deseeded and finely chopped red chilli (if using), 125ml red wine and 6 halved cherry tomatoes. Stir with a wooden spoon, breaking up the plum tomatoes.","Bring to the boil, reduce to a gentle simmer and cover with a lid. Cook for 1 hr 15 mins stirring occasionally, until you have a rich, thick sauce.","Add the 75g grated parmesan, check the seasoning and stir.","When the bolognese is nearly finished, cook 400g spaghetti following the pack instructions.","Drain the spaghetti and either stir into the bolognese sauce, or serve the sauce on top. Serve with more grated parmesan, the remaining basil leaves and crusty bread, if you like."]},{"id":2,"name":"Chicken Tikka Masala","description":"A classic Indian curry dish.","image":"/tikka.jpg","ingredients":["CHICKEN MARINADE","3 boneless, skinless chicken breasts","½ cup plain yogurt","2 tablespoons lemon juice","6 cloves garlic, minced","1 tablespoon minced ginger","2 teaspoons salt","2 teaspoons ground cumin","2 teaspoons garam masala","2 teaspoons paprika","SAUCE","3 tablespoons oil","1 large onion, finely chopped","2 tablespoons minced ginger","8 cloves garlic, minced","2 teaspoons ground cumin","2 teaspoons ground turmeric","2 teaspoons ground coriander","2 teaspoons paprika","2 teaspoons chili powder","2 teaspoons garam masala","1 tablespoon tomato puree","3 ½ cups tomato sauce","1 ¼ cups water","1 cup heavy cream","¼ cup fresh cilantro, for garnish","cooked rice, for serving","naan bread, for serving"],"directions":["Slice the chicken into bite-sized chunks. Combine the cubed chicken with the yogurt, lemon juice, garlic, ginger, salt, cumin, garam masala, and paprika and stir until well-coated.","Cover and refrigerate for at least 1 hour, or overnight.","Preheat the oven to 500°F (260°C). Line a high-sided baking pan or roasting tray with parchment paper.","Place the marinated chicken pieces on bamboo or wooden skewers, then set them over the prepared baking pan, making sure there is space underneath the chicken to help distribute the heat more evenly. Bake for about 15 minutes, until slightly dark brown on the edges.","Make the sauce: Heat the oil in a large pot over medium heat, then sauté the onions, ginger, and garlic until tender but not browned. Add the cumin, turmeric, coriander, paprika, chili powder, and garam masala and stir constantly for about 30 seconds, until the spices are fragrant. Stir in the tomato puree, tomato sauce, and 1 ¼ cups of water, then bring to a boil and cook for about 5 minutes. Pour in the cream.","Remove the chicken from the skewers and add to the sauce, cooking for another 1-2 minutes. Garnish with cilantro and serve over rice or alongside naan bread."]},{"id":3,"name":"Chicken Caesar Salad","description":"A classic American salad dish.","image":"/caesar.jpg","ingredients":["4 chicken breasts","2 tablespoons olive oil divided","2 tablespoons cajun seasoning* or to taste","8 cups romaine lettuce washed, dried","1 ½ cups croutons","¾ cup parmesan cheese grated"],"directions":["Combine all dressing ingredients and set aside.","Combine the chicken breasts and 1 tablespoon olive oil in a small bowl. Season with cajun spice, making sure to cover all of the chicken.","Heat up a large pan with remaining olive oil, add the chicken once hot and cook on each side ensuring that a dark crust is forming, blackening the chicken.","Cook until chicken has reached 165°F internally or place in the oven to finish them.","Once cooled, cut chicken breasts into slices.","In a large bowl, cut romaine lettuce into bite size pieces. Add croutons, parmesan cheese, and prepared chicken. Top with dressing and toss."]},{"name":"Spicy Ramen Tofu","description":"","image":"https://pinchofyum.com/cdn-cgi/image/width=680,height=99999,fit=scale-down/wp-content/uploads/Ramen-2.jpg","ingredients":["Spicy Miso Paste:","1 small yellow onion","1/2 cup red miso","1/2 cup white miso","3 tablespoons sambal oelek","6 cloves garlic","2 inch piece fresh ginger","3 tablespoons mirin","2 tablespoons vegetable oil","1 tablespoon toasted sesame oil","Ramen:","12–15 ounces extra firm tofu","1 tablespoon oil","4 eggs","5 ounces fresh shiitake mushrooms, chopped (but see notes about dried mushrooms!)","3–4 cups vegetable stock","2 cups plain unsweetened soy milk","6 ounces ramen noodles","scallions, roasted seaweed, sesame oil for serving"],"directions":["SPICY MISO PASTE: Pulse all miso paste ingredients together in a food processor until a smooth, thick paste forms. You will use about half of it for this recipe and the other half can be frozen or refrigerated for a few days.","TOFU: Press as much moisture as you can out of the tofu using paper towels or a tofu press. Cut into cubes. In a large pot, heat the oil on medium high heat and start frying the tofu. Once the tofu has browned, add 1/4 cup of the spicy miso paste and cook for another minute or two to get a nice golden color. Remove from pan and set aside.","BROTH: (SEE NOTES) To the same pan, add the chopped shiitake and a tablespoon or so of miso paste and stir fry until golden brown. Add the stock and soy milk and bring to a simmer. Place 1/2 cup spicy miso paste on top of a very fine sieve. Lower the sieve half-way into the simmering soup and use a spoon to slowly dissolve the paste into the soup. Discard the “solids” remaining in the sieve and let the soup simmer for another 5 minutes. Taste and adjust seasoning – add salt or a little soy sauce until it tastes like a spicy ramen broth.","EGGS and RAMEN: Cook the ramen noodles according to package instructions and drain well. While the ramen is cooking, bring a small pot of water to boil. When it reaches boiling, add 4 eggs and reduce heat to the lowest possible setting. Cook for exactly 7 minutes, remove eggs from water, run under cold water, and let them set for a few minutes. Peel shells off carefully. Yolks will be soft.","SERVING: Divide the noodles into four large bowl and ladle the soup on top (you may have a bit more than needed). For each serving, top with the tofu, 1 soft-boiled egg (cut in half), scallions, and sesame oil."],"id":4}]